{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel0", 
      "attr": {
        "num_outputs": "30", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l0_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_init_h", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l0_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[4, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t0_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[10, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[10, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_init_c", 
      "inputs": []
    }, 
    {
      "op": "_mul", 
      "name": "_mul0", 
      "inputs": [[12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[10, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul1", 
      "inputs": [[15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[14, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul2", 
      "inputs": [[11, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_init_h", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[23, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t0_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[29, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation7", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[29, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_init_c", 
      "inputs": []
    }, 
    {
      "op": "_mul", 
      "name": "_mul3", 
      "inputs": [[31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation6", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[29, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul4", 
      "inputs": [[34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[33, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation9", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5", 
      "inputs": [[30, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l0_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 1, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l0_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[20, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t1_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation13", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[43, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation12", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[43, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul6", 
      "inputs": [[45, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation10", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation11", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[43, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul7", 
      "inputs": [[47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[46, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation14", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul8", 
      "inputs": [[44, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[52, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[39, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t1_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[56, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation17", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[56, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul9", 
      "inputs": [[58, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation15", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation16", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[56, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10", 
      "inputs": [[60, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[59, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation19", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul11", 
      "inputs": [[57, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l0_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 2, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l0_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[52, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "inputs": [[66, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t2_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation23", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[69, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation22", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[69, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul12", 
      "inputs": [[71, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation20", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation21", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[69, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul13", 
      "inputs": [[73, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus9", 
      "inputs": [[72, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation24", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul14", 
      "inputs": [[70, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[78, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[65, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus10", 
      "inputs": [[79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t2_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation28", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[82, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation27", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[82, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul15", 
      "inputs": [[84, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation25", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation26", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[82, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul16", 
      "inputs": [[86, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus11", 
      "inputs": [[85, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation29", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul17", 
      "inputs": [[83, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l0_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 3, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l0_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[78, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus12", 
      "inputs": [[92, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t3_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation33", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[95, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation32", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[95, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul18", 
      "inputs": [[97, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation30", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation31", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[95, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul19", 
      "inputs": [[99, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus13", 
      "inputs": [[98, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation34", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul20", 
      "inputs": [[96, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[104, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[91, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus14", 
      "inputs": [[105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t3_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation38", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[108, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation37", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[108, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul21", 
      "inputs": [[110, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation35", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation36", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[108, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul22", 
      "inputs": [[112, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus15", 
      "inputs": [[111, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation39", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul23", 
      "inputs": [[109, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l0_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 4, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l0_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[104, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus16", 
      "inputs": [[118, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t4_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation43", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[121, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation42", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[121, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul24", 
      "inputs": [[123, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation40", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation41", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[121, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul25", 
      "inputs": [[125, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus17", 
      "inputs": [[124, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation44", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul26", 
      "inputs": [[122, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[130, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[117, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus18", 
      "inputs": [[131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t4_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation48", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[134, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation47", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[134, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul27", 
      "inputs": [[136, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation45", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation46", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[134, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul28", 
      "inputs": [[138, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus19", 
      "inputs": [[137, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation49", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul29", 
      "inputs": [[135, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l0_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 5, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l0_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[130, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus20", 
      "inputs": [[144, 0, 0], [145, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t5_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation53", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[147, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation52", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[147, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul30", 
      "inputs": [[149, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation50", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation51", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[147, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul31", 
      "inputs": [[151, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus21", 
      "inputs": [[150, 0, 0], [153, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation54", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul32", 
      "inputs": [[148, 0, 0], [155, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[156, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[143, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus22", 
      "inputs": [[157, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t5_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation58", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[160, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation57", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[160, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul33", 
      "inputs": [[162, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation55", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation56", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[160, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul34", 
      "inputs": [[164, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus23", 
      "inputs": [[163, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation59", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul35", 
      "inputs": [[161, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l0_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 6, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l0_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[156, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus24", 
      "inputs": [[170, 0, 0], [171, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t6_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation63", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[173, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation62", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[173, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul36", 
      "inputs": [[175, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation60", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[173, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation61", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[173, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul37", 
      "inputs": [[177, 0, 0], [178, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus25", 
      "inputs": [[176, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation64", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul38", 
      "inputs": [[174, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[182, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[169, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus26", 
      "inputs": [[183, 0, 0], [184, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t6_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation68", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[186, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation67", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[186, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul39", 
      "inputs": [[188, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation65", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[186, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation66", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[186, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul40", 
      "inputs": [[190, 0, 0], [191, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus27", 
      "inputs": [[189, 0, 0], [192, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation69", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[193, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul41", 
      "inputs": [[187, 0, 0], [194, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l0_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 7, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l0_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[182, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus28", 
      "inputs": [[196, 0, 0], [197, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t7_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation73", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[199, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation72", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[199, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul42", 
      "inputs": [[201, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation70", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[199, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation71", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[199, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul43", 
      "inputs": [[203, 0, 0], [204, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus29", 
      "inputs": [[202, 0, 0], [205, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation74", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul44", 
      "inputs": [[200, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[208, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[195, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus30", 
      "inputs": [[209, 0, 0], [210, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t7_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[211, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation78", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[212, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation77", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[212, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul45", 
      "inputs": [[214, 0, 0], [193, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation75", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[212, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation76", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[212, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul46", 
      "inputs": [[216, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus31", 
      "inputs": [[215, 0, 0], [218, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation79", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[219, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul47", 
      "inputs": [[213, 0, 0], [220, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t8_l0_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 8, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t8_l0_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[208, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus32", 
      "inputs": [[222, 0, 0], [223, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t8_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[224, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation83", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[225, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation82", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[225, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul48", 
      "inputs": [[227, 0, 0], [206, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation80", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[225, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation81", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[225, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul49", 
      "inputs": [[229, 0, 0], [230, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus33", 
      "inputs": [[228, 0, 0], [231, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation84", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul50", 
      "inputs": [[226, 0, 0], [233, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t8_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[234, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t8_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[221, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus34", 
      "inputs": [[235, 0, 0], [236, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t8_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation88", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[238, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation87", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[238, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul51", 
      "inputs": [[240, 0, 0], [219, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation85", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[238, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation86", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[238, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul52", 
      "inputs": [[242, 0, 0], [243, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus35", 
      "inputs": [[241, 0, 0], [244, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation89", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[245, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul53", 
      "inputs": [[239, 0, 0], [246, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t9_l0_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 9, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t9_l0_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[234, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus36", 
      "inputs": [[248, 0, 0], [249, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t9_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[250, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation93", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[251, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation92", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[251, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul54", 
      "inputs": [[253, 0, 0], [232, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation90", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[251, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation91", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[251, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul55", 
      "inputs": [[255, 0, 0], [256, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus37", 
      "inputs": [[254, 0, 0], [257, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation94", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[258, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul56", 
      "inputs": [[252, 0, 0], [259, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t9_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[260, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t9_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[247, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus38", 
      "inputs": [[261, 0, 0], [262, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t9_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[263, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation98", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[264, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation97", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[264, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul57", 
      "inputs": [[266, 0, 0], [245, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation95", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[264, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation96", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[264, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul58", 
      "inputs": [[268, 0, 0], [269, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus39", 
      "inputs": [[267, 0, 0], [270, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation99", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[271, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul59", 
      "inputs": [[265, 0, 0], [272, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t10_l0_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 10, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t10_l0_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[260, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus40", 
      "inputs": [[274, 0, 0], [275, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t10_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[276, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation103", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[277, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation102", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[277, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul60", 
      "inputs": [[279, 0, 0], [258, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation100", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[277, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation101", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[277, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul61", 
      "inputs": [[281, 0, 0], [282, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus41", 
      "inputs": [[280, 0, 0], [283, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation104", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[284, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul62", 
      "inputs": [[278, 0, 0], [285, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t10_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[286, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t10_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[273, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus42", 
      "inputs": [[287, 0, 0], [288, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t10_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[289, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation108", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[290, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation107", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[290, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul63", 
      "inputs": [[292, 0, 0], [271, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation105", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[290, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation106", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[290, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul64", 
      "inputs": [[294, 0, 0], [295, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus43", 
      "inputs": [[293, 0, 0], [296, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation109", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[297, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul65", 
      "inputs": [[291, 0, 0], [298, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t11_l0_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 11, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t11_l0_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[286, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus44", 
      "inputs": [[300, 0, 0], [301, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t11_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[302, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation113", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[303, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation112", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[303, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul66", 
      "inputs": [[305, 0, 0], [284, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation110", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[303, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation111", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[303, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul67", 
      "inputs": [[307, 0, 0], [308, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus45", 
      "inputs": [[306, 0, 0], [309, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation114", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[310, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul68", 
      "inputs": [[304, 0, 0], [311, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t11_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[312, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t11_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[299, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus46", 
      "inputs": [[313, 0, 0], [314, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t11_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[315, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation118", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[316, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation117", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[316, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul69", 
      "inputs": [[318, 0, 0], [297, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation115", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[316, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation116", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[316, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul70", 
      "inputs": [[320, 0, 0], [321, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus47", 
      "inputs": [[319, 0, 0], [322, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation119", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[323, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul71", 
      "inputs": [[317, 0, 0], [324, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t12_l0_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 12, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t12_l0_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[312, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus48", 
      "inputs": [[326, 0, 0], [327, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t12_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[328, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation123", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[329, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation122", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[329, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul72", 
      "inputs": [[331, 0, 0], [310, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation120", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[329, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation121", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[329, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul73", 
      "inputs": [[333, 0, 0], [334, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus49", 
      "inputs": [[332, 0, 0], [335, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation124", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[336, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul74", 
      "inputs": [[330, 0, 0], [337, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t12_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[338, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t12_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[325, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus50", 
      "inputs": [[339, 0, 0], [340, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t12_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[341, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation128", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[342, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation127", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[342, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul75", 
      "inputs": [[344, 0, 0], [323, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation125", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[342, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation126", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[342, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul76", 
      "inputs": [[346, 0, 0], [347, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus51", 
      "inputs": [[345, 0, 0], [348, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation129", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[349, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul77", 
      "inputs": [[343, 0, 0], [350, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t13_l0_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 13, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t13_l0_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[338, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus52", 
      "inputs": [[352, 0, 0], [353, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t13_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[354, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation133", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[355, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation132", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[355, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul78", 
      "inputs": [[357, 0, 0], [336, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation130", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[355, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation131", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[355, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul79", 
      "inputs": [[359, 0, 0], [360, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus53", 
      "inputs": [[358, 0, 0], [361, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation134", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[362, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul80", 
      "inputs": [[356, 0, 0], [363, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t13_l1_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[364, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t13_l1_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[351, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus54", 
      "inputs": [[365, 0, 0], [366, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t13_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[367, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation138", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[368, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation137", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[368, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul81", 
      "inputs": [[370, 0, 0], [349, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation135", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[368, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation136", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[368, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul82", 
      "inputs": [[372, 0, 0], [373, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus55", 
      "inputs": [[371, 0, 0], [374, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation139", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[375, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul83", 
      "inputs": [[369, 0, 0], [376, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t14_l0_i2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[1, 14, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t14_l0_h2h", 
      "attr": {"num_hidden": "512"}, 
      "inputs": [[364, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus56", 
      "inputs": [[378, 0, 0], [379, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t14_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[380, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation143", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[381, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation142", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[381, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul84", 
      "inputs": [[383, 0, 0], [362, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation140", 
      "attr": {"act_type": "sigmoid"}, 
